In [1]:
import pandas as pd

In [3]:
data = 'Resources/budget_data.csv'

data_df = pd.read_csv(data)
data_df.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [4]:
total_revenue = data_df['Profit/Losses'].sum()

print('Profit/Losses: ' + '$' + str(total_revenue))

Profit/Losses: $38382578

In [5]:
total_months = data_df['Date'].count()

print('Total Months: ' + str(total_months))

Total Months: 86

In [7]:
rev_difference = data_df['Profit/Losses'].diff()

rev_difference

data_df['Monthly Revenue Delta'] = rev_difference
data_df.head()

       Date  Profit/Losses  Monthly Revenue Delta
0  Jan-2010         867884                    NaN
1  Feb-2010         984655               116771.0
2  Mar-2010         322013              -662642.0
3  Apr-2010         -69417              -391430.0
4  May-2010         310503               379920.0

In [8]:
avg_monthly_delta = data_df['Monthly Revenue Delta'].mean()

print('Average Revenue Change: ' + '$' + str(round(avg_monthly_delta, 2)))

Average Revenue Change: $-2315.12

In [9]:
max_rev_change = data_df[['Date', 'Monthly Revenue Delta']][data_df['Monthly Revenue Delta'] == data_df['Monthly Revenue Delta'].max()]
max_rev_change

        Date  Monthly Revenue Delta
25  Feb-2012              1926159.0

In [10]:
min_rev_change = data_df[['Date', 'Monthly Revenue Delta']][data_df['Monthly Revenue Delta'] == data_df['Monthly Revenue Delta'].min()]
min_rev_change

        Date  Monthly Revenue Delta
44  Sep-2013             -2196167.0